In [1]:
import numpy as np
import pandas as pd
import os

In [2]:
path ='data/clean'

if not os.path.exists(path):
    os.mkdir(path)

In [3]:
median_house_income = pd.read_csv('data/MedianHouseholdIncome2015.csv', encoding= 'unicode_escape')
percentage_below_poverty_level = pd.read_csv('data/PercentagePeopleBelowPovertyLevel.csv', encoding= 'unicode_escape')
percent_over25_comp_highschool = pd.read_csv('data/PercentOver25CompletedHighSchool.csv', encoding= 'unicode_escape')
share_by_race = pd.read_csv('data/ShareRaceByCity.csv')
police_killings = pd.read_csv('data/PoliceKillingsUS.csv', encoding= 'unicode_escape')

median_house_income

#### assess

In [4]:
median_house_income.head()

  Geographic Area             City Median Income
0              AL       Abanda CDP         11207
1              AL   Abbeville city         25615
2              AL  Adamsville city         42575
3              AL     Addison town         37083
4              AL       Akron town         21667

In [5]:
median_house_income.dtypes

Geographic Area    object
City               object
Median Income      object
dtype: object

In [6]:
median_house_income.isnull().sum()

Geographic Area     0
City                0
Median Income      51
dtype: int64

In [7]:
median_house_income.duplicated().sum()

0

In [8]:
median_house_income['Median Income'].value_counts()

(X)       1113
-          740
38750      136
41250      125
43750      115
          ...
115789       1
45761        1
17644        1
104569       1
23492        1
Name: Median Income, Length: 14592, dtype: int64

- median Income type is object
- entries with null values, (X), - 
- column names contain spaces and capitalized (not really an issue but for better readability)

#### clean

In [9]:
median_house_income_clean = median_house_income.copy()

In [10]:
#set column names to lower and replace space with _
median_house_income_clean.rename(columns = lambda x: x.strip().lower().replace(' ','_'), inplace=True)

In [11]:
#extract numeric values only
median_house_income_clean.median_income = median_house_income_clean.median_income.str.extract('(\d+(?:\.\d+)?)')

In [12]:
#drop missing values
median_house_income_clean = median_house_income_clean.dropna().reset_index(drop=True)

#test
assert median_house_income_clean.isnull().sum().sum() == 0

In [13]:
#change median_income type to int
median_house_income_clean.median_income = median_house_income_clean.median_income.astype(int)

percent_over25_comp_highschool

In [14]:
percent_over25_comp_highschool.head()

  Geographic Area             City percent_completed_hs
0              AL       Abanda CDP                 21.2
1              AL   Abbeville city                 69.1
2              AL  Adamsville city                 78.9
3              AL     Addison town                 81.4
4              AL       Akron town                 68.6

In [15]:
percent_over25_comp_highschool.percent_completed_hs.value_counts()

100     1301
-        197
91.7     170
92.9     169
92.5     168
        ...
14.9       1
17.5       1
24.9       1
38.6       1
42.8       1
Name: percent_completed_hs, Length: 728, dtype: int64

In [16]:
percent_over25_comp_highschool.dtypes

Geographic Area         object
City                    object
percent_completed_hs    object
dtype: object

In [17]:
percent_over25_comp_highschool.isnull().sum()

Geographic Area         0
City                    0
percent_completed_hs    0
dtype: int64

In [18]:
percent_over25_comp_highschool.duplicated().sum()

0

- percent_completed_hs type is object
- percent_completed_hs non numeric values -,...
- column names contain spaces and capitalized (not really an issue but for better readability)

#### clean

In [19]:
percent_over25_comp_highschool_clean = percent_over25_comp_highschool.copy()

In [20]:
#set column names to lower and replace space with _
percent_over25_comp_highschool_clean.rename(columns = lambda x: x.strip().lower().replace(' ','_'), inplace=True)

In [21]:
#change poverty_rate column type
percent_over25_comp_highschool_clean.percent_completed_hs = percent_over25_comp_highschool_clean.percent_completed_hs.str.strip().str.extract('(\d+(?:\.\d+)?)', expand=False)
percent_over25_comp_highschool_clean.percent_completed_hs = percent_over25_comp_highschool_clean.percent_completed_hs.astype(float)

In [22]:
percent_over25_comp_highschool_clean.head()

  geographic_area             city  percent_completed_hs
0              AL       Abanda CDP                  21.2
1              AL   Abbeville city                  69.1
2              AL  Adamsville city                  78.9
3              AL     Addison town                  81.4
4              AL       Akron town                  68.6

percentage_below_poverty_level

In [23]:
percentage_below_poverty_level.head()

  Geographic Area             City poverty_rate
0              AL       Abanda CDP         78.8
1              AL   Abbeville city         29.1
2              AL  Adamsville city         25.5
3              AL     Addison town         30.7
4              AL       Akron town           42

In [24]:
percentage_below_poverty_level.poverty_rate.value_counts()

0       1464
-        201
7.4      129
6.7      129
10       128
        ...
84.8       1
84.7       1
89         1
73         1
74.8       1
Name: poverty_rate, Length: 771, dtype: int64

In [25]:
percentage_below_poverty_level.dtypes

Geographic Area    object
City               object
poverty_rate       object
dtype: object

In [26]:
percentage_below_poverty_level.isnull().sum()

Geographic Area    0
City               0
poverty_rate       0
dtype: int64

In [27]:
percentage_below_poverty_level.duplicated().sum()

0

- poverty_rate type is object
- poverty rate non numeric values -,...
- column names contain spaces and capitalized (not really an issue but for better readability)

#### clean

In [28]:
percentage_below_poverty_level_clean = percentage_below_poverty_level.copy()

In [29]:
#set column names to lower and replace space with _
percentage_below_poverty_level_clean.rename(columns = lambda x: x.strip().lower().replace(' ','_'), inplace=True)

In [30]:
#change poverty_rate column type
percentage_below_poverty_level_clean.poverty_rate = percentage_below_poverty_level_clean.poverty_rate.str.strip().str.extract('(\d+(?:\.\d+)?)', expand=False)
percentage_below_poverty_level_clean.poverty_rate = percentage_below_poverty_level_clean.poverty_rate.astype(float)

In [31]:
percentage_below_poverty_level_clean.head()

  geographic_area             city  poverty_rate
0              AL       Abanda CDP          78.8
1              AL   Abbeville city          29.1
2              AL  Adamsville city          25.5
3              AL     Addison town          30.7
4              AL       Akron town          42.0

share_by_race

In [32]:
share_by_race.head()

,Geographic area,City,share_white,share_black,share_native_american,share_asian,share_hispanic
0,AL,Abanda CDP,67.2,30.2,0,0,1.6
1,AL,Abbeville city,54.4,41.4,0.1,1,3.1
2,AL,Adamsville city,52.3,44.9,0.5,0.3,2.3
3,AL,Addison town,99.1,0.1,0,0.1,0.4
4,AL,Akron town,13.2,86.5,0,0,0.3

In [33]:
share_by_race.dtypes

Geographic area          object
City                     object
share_white              object
share_black              object
share_native_american    object
share_asian              object
share_hispanic           object
dtype: object

In [34]:
share_by_race.isnull().sum()

Geographic area          0
City                     0
share_white              0
share_black              0
share_native_american    0
share_asian              0
share_hispanic           0
dtype: int64

In [35]:
share_by_race.duplicated().sum()

0

- share_white,...,share_hispanic type is object
- column names contain spaces and capitalized (not really an issue but for better readability)

#### clean

In [39]:
share_by_race_clean = share_by_race.copy()

In [40]:
#set column names to lower and replace space with _
share_by_race_clean.rename(columns = lambda x: x.strip().lower().replace(' ','_'), inplace=True)

In [43]:
for col in ['share_white', 'share_black', 'share_native_american', 'share_asian', 'share_hispanic']:
    share_by_race_clean[col] = share_by_race_clean[col].str.strip().str.extract('(\d+(?:\.\d+)?)', expand=False)
    share_by_race_clean[col] = share_by_race_clean[col].astype(float)

In [44]:
share_by_race_clean.head()

,geographic_area,city,share_white,share_black,share_native_american,share_asian,share_hispanic
0,AL,Abanda CDP,67.2,30.2,0.0,0.0,1.6
1,AL,Abbeville city,54.4,41.4,0.1,1.0,3.1
2,AL,Adamsville city,52.3,44.9,0.5,0.3,2.3
3,AL,Addison town,99.1,0.1,0.0,0.1,0.4
4,AL,Akron town,13.2,86.5,0.0,0.0,0.3

police_killings

In [45]:
police_killings.head()

,id,name,date,manner_of_death,armed,age,gender,race,city,state,signs_of_mental_illness,threat_level,flee,body_camera
0,3,Tim Elliot,02/01/15,shot,gun,53.0,M,A,Shelton,WA,True,attack,Not fleeing,False
1,4,Lewis Lee Lembke,02/01/15,shot,gun,47.0,M,W,Aloha,OR,False,attack,Not fleeing,False
2,5,John Paul Quintero,03/01/15,shot and Tasered,unarmed,23.0,M,H,Wichita,KS,False,other,Not fleeing,False
3,8,Matthew Hoffman,04/01/15,shot,toy weapon,32.0,M,W,San Francisco,CA,True,attack,Not fleeing,False
4,9,Michael Rodriguez,04/01/15,shot,nail gun,39.0,M,H,Evans,CO,False,attack,Not fleeing,False

In [46]:
police_killings.dtypes

id                           int64
name                        object
date                        object
manner_of_death             object
armed                       object
age                        float64
gender                      object
race                        object
city                        object
state                       object
signs_of_mental_illness       bool
threat_level                object
flee                        object
body_camera                   bool
dtype: object

In [47]:
police_killings.isnull().sum()

id                           0
name                         0
date                         0
manner_of_death              0
armed                        9
age                         77
gender                       0
race                       195
city                         0
state                        0
signs_of_mental_illness      0
threat_level                 0
flee                        65
body_camera                  0
dtype: int64

In [48]:
police_killings.duplicated().sum()

0

- null values
- age, date object types

#### clean

In [49]:
police_killings_clean = police_killings.copy()

In [50]:
#drop missing values
police_killings_clean = police_killings_clean.dropna().reset_index(drop=True)

#test
assert police_killings_clean.isnull().sum().sum() == 0

In [52]:
#convert age to int
police_killings_clean.age = police_killings_clean.age.astype(np.uint8)

#convert date to date
police_killings_clean.date = pd.to_datetime(police_killings.date)

In [55]:
police_killings_clean.head()

,id,name,date,manner_of_death,armed,age,gender,race,city,state,signs_of_mental_illness,threat_level,flee,body_camera
0,3,Tim Elliot,2015-02-01,shot,gun,53,M,A,Shelton,WA,True,attack,Not fleeing,False
1,4,Lewis Lee Lembke,2015-02-01,shot,gun,47,M,W,Aloha,OR,False,attack,Not fleeing,False
2,5,John Paul Quintero,2015-03-01,shot and Tasered,unarmed,23,M,H,Wichita,KS,False,other,Not fleeing,False
3,8,Matthew Hoffman,2015-04-01,shot,toy weapon,32,M,W,San Francisco,CA,True,attack,Not fleeing,False
4,9,Michael Rodriguez,2015-04-01,shot,nail gun,39,M,H,Evans,CO,False,attack,Not fleeing,False

In [53]:
police_killings_clean.dtypes

id                                  int64
name                               object
date                       datetime64[ns]
manner_of_death                    object
armed                              object
age                                 uint8
gender                             object
race                               object
city                               object
state                              object
signs_of_mental_illness              bool
threat_level                       object
flee                               object
body_camera                          bool
dtype: object

### store cleaned dfs

In [58]:
police_killings_clean.to_csv(f'{path}/police_killings_clean.csv',index=False)
median_house_income_clean.to_csv(f'{path}/median_house_income_clean.csv',index=False)
percent_over25_comp_highschool_clean.to_csv(f'{path}/percent_over25_comp_highschool_clean.csv',index=False)
percentage_below_poverty_level_clean.to_csv(f'{path}/percentage_below_poverty_level_clean.csv',index=False)
share_by_race_clean.to_csv(f'{path}/share_by_race_clean.csv',index=False)